AndEmi81/indesit_inertia_rx210/HAL/RN_RX100/FCL/lib/r_fcl_hw_access.c
#ifdef ENABLE_QAC_TEST
    #pragma PRQA_MESSAGES_OFF 0292
#endif
/**********************************************************************************************************************
* Library       : Code Flash Access Library for Renesas RX100 devices, based on the MF3 Flash technology
*
* File Name     : $Source: r_fcl_hw_access.c $
* Lib. Version  : $RX111_FCL_LIB_VERSION_T01: V1.00 $
* Mod. Revision : $Revision: 1.22 $
* Mod. Date     : $Date: 2013/08/05 17:00:27MESZ $
* Device(s)     : MF3 Flash based RX100 microcontroller
* Description   : FCL hardware interface functions
**********************************************************************************************************************/

/**********************************************************************************************************************
* DISCLAIMER 
* This software is supplied by Renesas Electronics Corporation and is only  intended for use with Renesas products. 
* No other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all 
* applicable laws, including copyright laws. 
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING THIS SOFTWARE, WHETHER EXPRESS, IMPLIED 
* OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND 
* NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. 
* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS 
* AFFILIATED COMPANIES SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY 
* REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH 
* DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of 
* this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link: 
* http://www.renesas.com/disclaimer 
* 
* Copyright (C) 2012-2013 Renesas Electronics Corporation. All rights reserved.     
**********************************************************************************************************************/

#ifdef ENABLE_QAC_TEST
    #pragma PRQA_MESSAGES_ON 0292
#endif

/**********************************************************************************************************************
* MISRA Rule:   MISRA-C 2004 rule 3.1 (QAC message 0292)
* Reason:       To support automatic insertion of revision, module name etc. by the source revision control system 
*               it is necessary to violate the rule, because the system uses non basic characters as placeholders.
* Verification: The placeholders are used in commentars only. Therefore rule violation cannot influency code 
*               compilation.
**********************************************************************************************************************/

/**********************************************************************************************************************
* MISRA Rule:   MISRA-C 2004 rule 11.3 (QAC message 0303)
* Reason:       For effective embedded programming, integer to pointer conversions are used
* Verification: The converted addresses are essential for complete code execution. Incorrect conversion would 
*               result in test fails.
**********************************************************************************************************************/


/**********************************************************************************************************************
Includes   <System Includes> , "Project Includes"  
**********************************************************************************************************************/
#include "r_typedefs.h"
#include "r_fcl_types.h"
#include "fcl_cfg.h"
#include "r_fcl.h"
#include "r_fcl_env.h"
#include "r_fcl_global.h"

#if   FCL_LIB_COMPILER == FCL_LIB_COMP_GCC
    #include "RN_RX100_reg.h"
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_IAR
    #include "iorx111.h"
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_REC
    #include "rx111_iodefine_v050.h"
#endif

/**********************************************************************************************************************
Macro definitions
**********************************************************************************************************************/
#define FCL_SPA_SIZE_SHIFT_BIT               (14u)

/**********************************************************************************************************************
Private global variables and functions 
**********************************************************************************************************************/
FCL_STATIC void     R_FCL_FCB_WriteRegFLPMC   ( const uint8_t val_u08 )   GCC_SECTION(".PRAM");
FCL_STATIC void     R_FCL_WriteMemoryU16      ( const uint32_t addr_u32, 
                                                const uint16_t val_u16 )  GCC_SECTION(".PRAM");
FCL_STATIC uint8_t  R_FCL_ReadMemoryU08       ( const uint32_t addr_u32 ) GCC_SECTION(".PRAM");
FCL_STATIC uint16_t R_FCL_ReadMemoryU16       ( const uint32_t addr_u32 ) GCC_SECTION(".PRAM");
FCL_STATIC void     R_FCL_CheckSetBitEEEMD    ( void ) 					  GCC_SECTION(".PRAM");
FCL_STATIC void     R_FCL_CheckResetBitEEEMD  ( void )                    GCC_SECTION(".PRAM");


/**********************************************************************************************************************
 * Helper functions
 *********************************************************************************************************************/
/**********************************************************************************************************************
 * Function name: R_FCL_FCB_WriteRegFLPMC 
 *********************************************************************************************************************/
/**
 *  Helper function that writes the FLPMC register, that is secured by a special sequence. The write must be ckecked 
 *  in a loop, as an interrupt handling can lead to a wrong sequence, thus preventing the write. 
 *  In this case the write must be repeated.  
 *
 * @param     val_u08:      The value to be written in register FLPMC
 *
 * @return    ---
 */  
/*********************************************************************************************************************/
#if FCL_LIB_COMPILER == FCL_LIB_COMP_GNU
    /* Pragma is not available, but the functionality can be achieved using __attribute__ in function declaration */
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_IAR
    #pragma location="R_FCL_CODE_RAM"
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_REC
    #pragma section P R_FCL_CODE_RAM
#endif
FCL_STATIC void R_FCL_FCB_WriteRegFLPMC ( const uint8_t val_u08 )
{
    volatile uint8_t reg_FLPMC; 

    do
    {
        R_FCL_WriteMemoryU08 (FCB_REG_ADDR_PFCMD_U08, FCB_REG_PFCMD_CMD);
        R_FCL_WriteMemoryU08 (FCB_REG_ADDR_FLPMC_U08, val_u08);
        R_FCL_WriteMemoryU08 (FCB_REG_ADDR_FLPMC_U08, (~val_u08));
        R_FCL_WriteMemoryU08 (FCB_REG_ADDR_FLPMC_U08, val_u08);

