AndEmi81/indesit_inertia_rx210/HAL/RN_RX100/FCL/lib/r_fcl_hw_access.c
        reg_FLPMC = R_FCL_ReadMemoryU08 (FCB_REG_ADDR_FLPMC_U08);
    }
    while (reg_FLPMC != val_u08);
}
/**********************************************************************************************************************
 * End of function R_FCL_FCB_WriteRegFLPMC  
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function name: R_FCL_WriteMemoryU16 
 *********************************************************************************************************************/
/**
 * Helper function that writes a 16-bit IO register or memory
 *
 * @param     addr_u32:      write destination address
 * @param     val_u16:       16-bit write data
 *
 * @return    ---
 */ 
/*********************************************************************************************************************/
#if FCL_LIB_COMPILER == FCL_LIB_COMP_GNU
    /* Pragma is not available, but the functionality can be achieved using __attribute__ in function declaration */
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_IAR
    #pragma location="R_FCL_CODE_RAM"
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_REC
    #pragma section P R_FCL_CODE_RAM
#endif
FCL_STATIC void R_FCL_WriteMemoryU16 ( const uint32_t addr_u32, const uint16_t val_u16 )
{
    ( *( (volatile uint16_t *)(addr_u32) ) ) = val_u16;                                            /* PRQA S 0303 */
}
/**********************************************************************************************************************
 End of function R_FCL_WriteMemoryU16  
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function name: R_FCL_ReadMemoryU08 
 *********************************************************************************************************************/
/**
 * Helper function to read a 8-bit IO register or memory
 *
 * @param     addr_u32:      Source address
 * 
 * @return    8-bit register contents    
 */  
/*********************************************************************************************************************/
#if FCL_LIB_COMPILER == FCL_LIB_COMP_GNU
    /* Pragma is not available, but the functionality can be achieved using __attribute__ in function declaration */
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_IAR
    #pragma location="R_FCL_CODE_RAM"
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_REC
    #pragma section P R_FCL_CODE_RAM
#endif
FCL_STATIC uint8_t R_FCL_ReadMemoryU08 ( const uint32_t addr_u32 )
{
    return ( *( (volatile uint8_t *)(addr_u32) ) );                                                /* PRQA S 0303 */
}
/**********************************************************************************************************************
 End of function R_FCL_ReadMemoryU08  
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function name: R_FCL_ReadMemoryU16 
 *********************************************************************************************************************/
/**
 * Helper function to read a 16-bit IO register or memory
 *
 * @param     addr_u32:      Source address
 * 
 * @return    16-bit register contents    
 */  
/*********************************************************************************************************************/
#if FCL_LIB_COMPILER == FCL_LIB_COMP_GNU
    /* Pragma is not available, but the functionality can be achieved using __attribute__ in function declaration */
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_IAR
    #pragma location="R_FCL_CODE_RAM"
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_REC
    #pragma section P R_FCL_CODE_RAM
#endif
FCL_STATIC uint16_t R_FCL_ReadMemoryU16 ( const uint32_t addr_u32 )
{
    return ( *( (volatile uint16_t *)(addr_u32) ) );                                               /* PRQA S 0303 */
}
/**********************************************************************************************************************
 End of function R_FCL_ReadMemoryU16  
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function name: R_FCL_CheckSetBitEEEMD 
 *********************************************************************************************************************/
/**
 * Helper function:
 * In order to modify the temporary start-up program swap flags, the bits EEEMD or FLSPM have to be set. 
 * This function checks if at least one of the mentioned bits are set, if not sets the bit EEEMD.
 *
 * @param     ---
 * @return    ---   
 */  
/*********************************************************************************************************************/
#if FCL_LIB_COMPILER == FCL_LIB_COMP_GNU
    /* Pragma is not available, but the functionality can be achieved using __attribute__ in function declaration */
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_IAR
    #pragma location="R_FCL_CODE_ROMRAM"
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_REC
    #pragma section P R_FCL_CODE_ROMRAM
#endif
FCL_STATIC void R_FCL_CheckSetBitEEEMD( void )
{
    volatile uint8_t    reg_FLPMC;

    reg_FLPMC = R_FCL_ReadMemoryU08 (FCB_REG_ADDR_FLPMC_U08);
    if (0 == (reg_FLPMC & (FCB_REG_BIT_FLPMC_EEEMD | FCB_REG_BIT_FLPMC_FLSPM)))
    {
        reg_FLPMC |= FCB_REG_BIT_FLPMC_EEEMD;
        R_FCL_FCB_WriteRegFLPMC (reg_FLPMC);
        g_fclInternal_str.resetReg_FLPMC_Flag_b = true;
    }
}
/**********************************************************************************************************************
 End of function R_FCL_CheckSetBitEEEMD  
 *********************************************************************************************************************/
 
/**********************************************************************************************************************
 * Function name: R_FCL_CheckResetBitEEEMD 
 *********************************************************************************************************************/
/**
 * Helper function:
 * In order to modify the temporary start-up program swap flags, the bits EEEMD or FLSPM have to be set. 
 * This function checks if bit EEEMD was set by function R_FCL_CheckSetBitEEEMD, if so restores 
 * the previous value of FLPMC register.
 *
 * @param     ---
 * @return    ---   
 */  
/*********************************************************************************************************************/
#if FCL_LIB_COMPILER == FCL_LIB_COMP_GNU
    /* Pragma is not available, but the functionality can be achieved using __attribute__ in function declaration */
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_IAR
    #pragma location="R_FCL_CODE_ROMRAM"
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_REC
    #pragma section P R_FCL_CODE_ROMRAM
#endif
FCL_STATIC void R_FCL_CheckResetBitEEEMD( void )
{
    volatile uint8_t    reg_FLPMC;

    if (true == g_fclInternal_str.resetReg_FLPMC_Flag_b)
    {
        reg_FLPMC = R_FCL_ReadMemoryU08 (FCB_REG_ADDR_FLPMC_U08);
        reg_FLPMC &= (~FCB_REG_BIT_FLPMC_EEEMD);
        R_FCL_FCB_WriteRegFLPMC (reg_FLPMC);
        g_fclInternal_str.resetReg_FLPMC_Flag_b = false;
    }
}
/**********************************************************************************************************************
 End of function R_FCL_CheckResetBitEEEMD  
 *********************************************************************************************************************/



/**********************************************************************************************************************
 * Interface functions
 *********************************************************************************************************************/
/**********************************************************************************************************************
 * Function name: R_FCL_WriteMemoryU08 
 *********************************************************************************************************************/
/**
 * Helper function that writes a 8-bit IO register or memory
 *
 * @param     addr_u32:      write destination address
 * @param     val_u8:        8-bit write data
 *
 * @return    ---
 */  
/*********************************************************************************************************************/
#if FCL_LIB_COMPILER == FCL_LIB_COMP_GNU
    /* Pragma is not available, but the functionality can be achieved using __attribute__ in function declaration */
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_IAR
    #pragma location="R_FCL_CODE_RAM"
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_REC
    #pragma section P R_FCL_CODE_RAM
#endif
void R_FCL_WriteMemoryU08 ( const uint32_t addr_u32, const uint8_t val_u8 )
{
    ( *( (volatile uint8_t *)(addr_u32) ) ) = val_u8;                                              /* PRQA S 0303 */
}
/**********************************************************************************************************************
 End of function R_FCL_WriteMemoryU08  
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function name: R_FCL_FCB_CheckReady 
 *********************************************************************************************************************/
/**
 *  Returns sequencer busy/ready status 
 *  The sequencer might be busy or not busy (not configured or configured operation already finished) 
 *
 * @param         ---
 *
 * @return        Status of the sequencer:
 * @li            R_FCL_TRUE  - Sequencer is not busy with a Flash operation  
 * @li            R_FCL_FALSE - Sequencer is busy with a Flash operation
 */  
/*********************************************************************************************************************/
#if FCL_LIB_COMPILER == FCL_LIB_COMP_GNU
    /* Pragma is not available, but the functionality can be achieved using __attribute__ in function declaration */
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_IAR
    #pragma location="R_FCL_CODE_RAM"
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_REC
    #pragma section P R_FCL_CODE_RAM
#endif
r_fcl_flag_t R_FCL_FCB_CheckReady ( void )
{
    r_fcl_flag_t        fcb_ready_flag = R_FCL_FALSE;
    volatile uint8_t    reg_FSASTH;

