AndEmi81/indesit_inertia_rx210/HAL/RN_RX100/FCL/lib/r_fcl_hw_access.c
    reg_FSASTH = R_FCL_ReadMemoryU08 (FCB_REG_ADDR_FSASTH_U08);
    
    if (FCL_EXTRA_AREA_OP == g_fclInternal_str.fclOpType_u08)
    {
        if (FCB_REG_BIT_FSASTH_ESQEND == (reg_FSASTH & FCB_REG_BIT_FSASTH_ESQEND))
        {
            fcb_ready_flag = R_FCL_TRUE;
        }
    }
    else
    {
        /* Flash Operation */
        if (  (FCB_REG_BIT_FSASTH_SQEND  == (reg_FSASTH & FCB_REG_BIT_FSASTH_SQEND))
           || (FCB_REG_BIT_FSASTH_DRREQ  == (reg_FSASTH & FCB_REG_BIT_FSASTH_DRREQ))
           )
        {
            fcb_ready_flag = R_FCL_TRUE;
        }
    }

    return fcb_ready_flag;
}
/**********************************************************************************************************************
 End of function R_FCL_FCB_CheckReady  
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function name: R_FCL_FCB_ReadOperation 
 *********************************************************************************************************************/
/**
 * Reads out data to output buffer, resets the data read request flag and starts a new read command.
 * Called by R_FCL_HandleMultiOperation, to handle multiple READ operation. 
 *
 * @param         ---
 * @return        ---
 */
/*********************************************************************************************************************/
#if FCL_LIB_COMPILER == FCL_LIB_COMP_GNU
    /* Pragma is not available, but the functionality can be achieved using __attribute__ in function declaration */
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_IAR
    #pragma location="R_FCL_CODE_RAM"
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_REC
    #pragma section P R_FCL_CODE_RAM
#endif
void R_FCL_FCB_ReadOperation ( void )
{
    volatile uint8_t   reg_FSASTH;
    volatile uint16_t  reg_data;

    /* Read information from registers and save it into output buffer */
    reg_data = R_FCL_ReadMemoryU16 (FCB_REG_ADDR_FLRH_U16);
    *((g_fclInternal_str.multiOp_str).dstAddr_pu32) = (uint32_t)(reg_data) << 16;
    reg_data = R_FCL_ReadMemoryU16 (FCB_REG_ADDR_FLRL_U16);
    *((g_fclInternal_str.multiOp_str).dstAddr_pu32) |=  reg_data ;

    /* Clear data read request flag */
    R_FCL_WriteMemoryU08 ( FCB_REG_ADDR_FSSQ_U08,
                           (FCB_REG_BIT_FSSQ_SQST | FCB_REG_BIT_FSSQ_DSETEN | FCB_REG_BIT_FSSQ_CMD_READ) );
    do
    {
        reg_FSASTH = R_FCL_ReadMemoryU08 (FCB_REG_ADDR_FSASTH_U08);
    } while (FCB_REG_BIT_FSASTH_DRREQ == (reg_FSASTH & FCB_REG_BIT_FSASTH_DRREQ));

    /* Start a new read command*/
    R_FCL_WriteMemoryU08 (FCB_REG_ADDR_FSSQ_U08, (FCB_REG_BIT_FSSQ_SQST | FCB_REG_BIT_FSSQ_CMD_READ));
}
/**********************************************************************************************************************
 End of function R_FCL_FCB_ReadOperation  
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function name: R_FCL_FCB_GetOpStatus 
 *********************************************************************************************************************/
/**
 * Return FCB Flash operation result. Called by R_FCL_StatusCheck.
 *
 * @param         ---
 * @return        Operation status:
 * @li            R_FCL_OK:             Operation terminated successfully 
 * @li            R_FCL_BUSY:           Operation is still on-going 
 * @li            R_FCL_ERR_WRITE:      Flash write error
 * @li            R_FCL_ERR_ERASE:      Flash erase error
 * @li            R_FCL_ERR_BLANKCHECK: Flash blank check error
 */  
/*********************************************************************************************************************/
#if FCL_LIB_COMPILER == FCL_LIB_COMP_GNU
    /* Pragma is not available, but the functionality can be achieved using __attribute__ in function declaration */
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_IAR
    #pragma location="R_FCL_CODE_RAM"
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_REC
    #pragma section P R_FCL_CODE_RAM
#endif
r_fcl_status_t R_FCL_FCB_GetOpStatus ( void )
{
    r_fcl_status_t      status;
    volatile uint8_t    reg_FSASTL;

    /* Read background operation result */
    reg_FSASTL =  R_FCL_ReadMemoryU08 (FCB_REG_ADDR_FSASTL_U08);
    reg_FSASTL &= FCB_REG_MASK_FSASTL_ERR;

    #ifdef FCL_TEST_PATCH
        if (test_patch.act_flag_FSASTL != false)
        {
            reg_FSASTL = test_patch.reg_FSASTL;
            test_patch.act_flag_FSASTL = false;
        }
    #endif

    /* Check if the operation finished with an error */
    if (FCB_REG_BITS_FSASTL_FLASH_OK == reg_FSASTL)
    {
        /* No error */
        status = R_FCL_OK;
    }
    else
    {
        if (  (FCB_REG_BIT_FSASTL_BLER == reg_FSASTL)
           && (FCB_REG_BIT_FSSQ_CMD_BC == (g_fclInternal_str.multiOp_str).fcbCmd_u08)
           )
        {
            status = R_FCL_ERR_BLANKCHECK;
        }
        else if (  (FCB_REG_BIT_FSASTL_WRER == reg_FSASTL)
                && (FCB_REG_BIT_FSSQ_CMD_WRITE == (g_fclInternal_str.multiOp_str).fcbCmd_u08)
                )
        {
            status = R_FCL_ERR_WRITE;
        }
        else if (  (FCB_REG_BIT_FSASTL_ERER == reg_FSASTL)
                && (FCB_REG_BIT_FSSQ_CMD_ERASE == (g_fclInternal_str.multiOp_str).fcbCmd_u08)
                )
        {
            status = R_FCL_ERR_ERASE;
        }
        else if (  (FCB_REG_BIT_FSASTL_SEQER == reg_FSASTL)
                && (  (FCB_REG_BIT_FSSQ_CMD_ERASE == (g_fclInternal_str.multiOp_str).fcbCmd_u08) 
                   || (FCB_REG_BIT_FSSQ_CMD_WRITE == (g_fclInternal_str.multiOp_str).fcbCmd_u08)
                   )
                )
        {
            /* For write and erase operations, in case the specified area is outside of the AW 
               return R_FCL_ERR_PROTECTION */
            status = R_FCL_ERR_PROTECTION;
        }
        else
        {
            /* Sequence error */
            status = R_FCL_ERR_INTERNAL;
        }
    }

