AndEmi81/indesit_inertia_rx210/HAL/RN_RX100/FCL/lib/r_fcl_hw_access.c
    return status;
}
/**********************************************************************************************************************
 End of function R_FCL_FCB_GetOpStatus  
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function name: R_FCL_FCB_ClearControlReg 
 *********************************************************************************************************************/
/**
 * Resets the control registers after an operation is finished. 
 *
 * @param         ---
 *
 * @return        ---
 */  
/*********************************************************************************************************************/
#if FCL_LIB_COMPILER == FCL_LIB_COMP_GNU
    /* Pragma is not available, but the functionality can be achieved using __attribute__ in function declaration */
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_IAR
    #pragma location="R_FCL_CODE_RAM"
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_REC
    #pragma section P R_FCL_CODE_RAM
#endif
void R_FCL_FCB_ClearControlReg ( void )
{
    volatile uint8_t    reg_FSASTH;

    if (FCL_EXTRA_AREA_OP == g_fclInternal_str.fclOpType_u08)
    {
        /* Reset sequencer control registers */
        R_FCL_WriteMemoryU08 (FCB_REG_ADDR_FSSE_U08, FCB_CONTROL_REG_RESET);
        
        do
        {
            reg_FSASTH = R_FCL_ReadMemoryU08 (FCB_REG_ADDR_FSASTH_U08);
        }
        while (FCB_REG_BIT_FSASTH_ESQEND == (FCB_REG_BIT_FSASTH_ESQEND & reg_FSASTH));
    }
    else
    {
        /* Reset sequencer control registers for Flash operations */
        R_FCL_WriteMemoryU08 (FCB_REG_ADDR_FSSQ_U08, FCB_CONTROL_REG_RESET);
        
        do
        {
            reg_FSASTH = R_FCL_ReadMemoryU08 (FCB_REG_ADDR_FSASTH_U08);
        }
        while (FCB_REG_BIT_FSASTH_SQEND  == (FCB_REG_BIT_FSASTH_SQEND & reg_FSASTH));
    }

    /* For extra area operation and Read operation, the data flash access needs to be modified by the library,
       return to previous data access state, if activated by library */
    if (FCL_DATA_FLASH_ACCESS_BY_LIBRARY == g_fclInternal_str.fclDataFlashMemAccess_u08)
    {
        FLASH.DFLCTL.BIT.DFLEN = 0;                                                                /* PRQA S 0303 */
        g_fclInternal_str.fclDataFlashMemAccess_u08 = 0x0;
    }
}
/**********************************************************************************************************************
 End of function R_FCL_FCB_ClearControlReg  
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function name: R_FCL_FCB_Reset 
 *********************************************************************************************************************/
/**
 * Reset Flash programming sequencer. As the reset does not work on running sequencer and in case of transient        
 * conditions, it must be stopped first. 
 *
 * @param         ---
 * 
 * @return        ---
 */
/*********************************************************************************************************************/
#if FCL_LIB_COMPILER == FCL_LIB_COMP_GNU
    /* Pragma is not available, but the functionality can be achieved using __attribute__ in function declaration */
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_IAR
    #pragma location="R_FCL_CODE_ROM"
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_REC
    #pragma section P R_FCL_CODE_ROM
#endif 
void R_FCL_FCB_Reset ( void )
{
    volatile uint8_t   reg_FSSQ;
    volatile uint8_t   reg_FSSE;
    volatile uint8_t   reg_FSASTH;

    reg_FSSQ = R_FCL_ReadMemoryU08 (FCB_REG_ADDR_FSSQ_U08);
    reg_FSSE = R_FCL_ReadMemoryU08 (FCB_REG_ADDR_FSSE_U08);

    /* Check if extra area operation is on */
    if (FCB_REG_BIT_FSSE_ESQST == (reg_FSSE & FCB_REG_BIT_FSSE_ESQST))
    {
        /* Wait for the extra area operation to finish */
        do 
        { 
            reg_FSASTH = R_FCL_ReadMemoryU08 (FCB_REG_ADDR_FSASTH_U08);
        }
        while (FCB_REG_BIT_FSASTH_ESQEND != (FCB_REG_BIT_FSASTH_ESQEND & reg_FSASTH));

        R_FCL_WriteMemoryU08(FCB_REG_ADDR_FSSE_U08, FCB_CONTROL_REG_RESET);

        do 
        { 
            reg_FSASTH = R_FCL_ReadMemoryU08 (FCB_REG_ADDR_FSASTH_U08);
        }
        while (FCB_REG_BIT_FSASTH_ESQEND == (FCB_REG_BIT_FSASTH_ESQEND & reg_FSASTH));
    }
    else
    {
        /* Stop the sequencer if it is busy */
        if (FCB_REG_BIT_FSSQ_SQST == (reg_FSSQ & FCB_REG_BIT_FSSQ_SQST))
        {
            reg_FSSQ |= FCB_REG_BIT_FSSQ_FSSTP;
            R_FCL_WriteMemoryU08 (FCB_REG_BIT_FSSQ_SQST, reg_FSSQ);
            
            do
            {
                reg_FSASTH = R_FCL_ReadMemoryU08 (FCB_REG_ADDR_FSASTH_U08);
            }
            while (FCB_REG_BIT_FSASTH_SQEND != (FCB_REG_BIT_FSASTH_SQEND & reg_FSASTH));

            R_FCL_WriteMemoryU08(FCB_REG_ADDR_FSSQ_U08, FCB_CONTROL_REG_RESET);

            do 
            { 
                reg_FSASTH = R_FCL_ReadMemoryU08 (FCB_REG_ADDR_FSASTH_U08);
            }
            while (FCB_REG_BIT_FSASTH_SQEND == (FCB_REG_BIT_FSASTH_SQEND & reg_FSASTH));
        }
    }

    /* Issue reset signal on stopped sequencer */
    R_FCL_WriteMemoryU08 (FCB_REG_ADDR_FLRST_U08, FCB_REG_BIT_FLRST_FLRST);
    R_FCL_WriteMemoryU08 (FCB_REG_ADDR_FLRST_U08, 0x00);
}
/**********************************************************************************************************************
 End of function R_FCL_FCB_Reset  
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function name: R_FCL_FCB_SwitchMode 
 *********************************************************************************************************************/
/**
 * Switch FCB mode to Programming/User mode 
 *
 * @param         mode_enu:               Modes:
 * @li                                    R_FCL_FCB_MODE_USER
 * @li                                    R_FCL_FCB_MODE_PE
 *
 * @return        Operation status:
 * @li            R_FCL_OK:             Operation terminated successfully
 * @li            R_FCL_ERR_PROTECTION: Low speed operating mode, flash operations are prohibited
 */  
/*********************************************************************************************************************/
#if FCL_LIB_COMPILER == FCL_LIB_COMP_GNU
    /* Pragma is not available, but the functionality can be achieved using __attribute__ in function declaration */
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_IAR
    #pragma location="R_FCL_CODE_RAM"
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_REC
    #pragma section P R_FCL_CODE_RAM
#endif
r_fcl_status_t R_FCL_FCB_SwitchMode ( const r_fcl_fcb_mode_t mode_enu )
{
    r_fcl_status_t       status = R_FCL_OK;
    volatile uint8_t     reg_FSSET;

    if (R_FCL_FCB_MODE_USER == mode_enu)
    {
        /* Enter user mode: special sequence needed */
        R_FCL_FCB_WriteRegFLPMC (FCB_REG_BIT_FLPMC_CWEE  |
                                   FCB_REG_BIT_FLPMC_EEEMD |
                                   FCB_REG_BIT_FLPMC_FLSPM);

        R_FCL_WaitUs (WAIT_TDIS_TIME_Us, g_fclInternal_str.fclCpuFreqMHz_u08);

