AndEmi81/indesit_inertia_rx210/HAL/RN_RX100/FCL/lib/r_fcl_hw_access.c
        R_FCL_FCB_WriteRegFLPMC (FCB_REG_BIT_FLPMC_EEEMD | FCB_REG_BIT_FLPMC_FLSPM);

        R_FCL_FCB_WriteRegFLPMC (FCB_REG_BIT_FLPMC_FWEDIS);

        /* operating mode: high speed or middle speed */ 
        if (REG_OPCCR_MASK_MODE_HIGH_SPEED == (uint8_t)SYSTEM.OPCCR.BIT.OPCM)                      /* PRQA S 0303 */
        {
            R_FCL_WaitUs (WAIT_TMS_TIME_HS_Us, g_fclInternal_str.fclCpuFreqMHz_u08);
        }
        else
        {
            R_FCL_WaitUs (WAIT_TMS_TIME_MS_Us, g_fclInternal_str.fclCpuFreqMHz_u08);
        }

        /* set bit FENTRYRI = 0 */
        R_FCL_WriteMemoryU16 (RX_SFR_REG_ADDR_FENTRYR_U16, RX_SFR_REG_BIT_FENTRYR_KEYCODE);
    }
    else
    {
        /* Start programming/erase mode: special sequence needed */
        /* check the operating mode: if low speed then operations are not allowed */
        if (0 == SYSTEM.SOPCCR.BIT.SOPCM)                                                          /* PRQA S 0303 */
        {
            /* enable code flash operations */
            R_FCL_WriteMemoryU16 ( RX_SFR_REG_ADDR_FENTRYR_U16,
                                    (RX_SFR_REG_BIT_FENTRYR_KEYCODE | RX_SFR_REG_BIT_FENTRYR_FENTRYI));

            R_FCL_FCB_WriteRegFLPMC (FCB_REG_BIT_FLPMC_EEEMD | FCB_REG_BIT_FLPMC_FLSPM);

            R_FCL_WaitUs (WAIT_TDIS_TIME_Us, g_fclInternal_str.fclCpuFreqMHz_u08);

            if (REG_OPCCR_MASK_MODE_HIGH_SPEED == (uint8_t)SYSTEM.OPCCR.BIT.OPCM)                  /* PRQA S 0303 */
            {
                /* High speed operating mode */
                R_FCL_FCB_WriteRegFLPMC (FCB_REG_BIT_FLPMC_CWEE  |
                                           FCB_REG_BIT_FLPMC_EEEMD |
                                           FCB_REG_BIT_FLPMC_FLSPM);

                R_FCL_FCB_WriteRegFLPMC (FCB_REG_BIT_FLPMC_CWEE | FCB_REG_BIT_FLPMC_FLSPM);

                R_FCL_WaitUs (WAIT_TMS_TIME_HS_Us, g_fclInternal_str.fclCpuFreqMHz_u08);
            }
            else
            {
                /* Middle speed operating mode */
                R_FCL_FCB_WriteRegFLPMC (FCB_REG_BIT_FLPMC_CWEE   |
                                           FCB_REG_BIT_FLPMC_LOWSPY |
                                           FCB_REG_BIT_FLPMC_EEEMD  |
                                           FCB_REG_BIT_FLPMC_FLSPM);

                R_FCL_FCB_WriteRegFLPMC (FCB_REG_BIT_FLPMC_CWEE   |
                                           FCB_REG_BIT_FLPMC_LOWSPY |
                                           FCB_REG_BIT_FLPMC_FLSPM);

                R_FCL_WaitUs (WAIT_TMS_TIME_MS_Us, g_fclInternal_str.fclCpuFreqMHz_u08);
            }

            /* Frequency set */
            reg_FSSET = R_FCL_ReadMemoryU08 (FCB_REG_ADDR_FSSET_U08);
            reg_FSSET &= (~FCB_REG_MASK_FSSET_FSET);
            reg_FSSET |= (uint8_t)(g_fclInternal_str.fclFlashIfFreqMHz_u08 - 1);
            R_FCL_WriteMemoryU08 (FCB_REG_ADDR_FSSET_U08, reg_FSSET);
        }
        else
        {
            status = R_FCL_ERR_PROTECTION;
        }

    }

    return status;
} 
/**********************************************************************************************************************
 End of function R_FCL_FCB_SwitchMode  
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function name: R_FCL_FCB_StartFlashOperation 
 *********************************************************************************************************************/
/**
 * This function configures the Flash programming sequencer and starts the operation 
 *
 * @param         flash_addr_u32:       Start address (start block address for erase, 1st address for BC/Write/IV/Read)
 * @param         data_or_end_addr_u32: End address of the Flash operation on Erase/BC/IV/Read or data for Write
 * @param         fcb_cmd_u08:          Type of command. Erase / BC / IV / Write / Read
 *
 * @return        ---
 */  
/*********************************************************************************************************************/
#if FCL_LIB_COMPILER == FCL_LIB_COMP_GNU
    /* Pragma is not available, but the functionality can be achieved using __attribute__ in function declaration */
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_IAR
    #pragma location="R_FCL_CODE_RAM"
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_REC
    #pragma section P R_FCL_CODE_RAM
#endif
void R_FCL_FCB_StartFlashOperation ( const uint32_t flash_addr_u32,
                                     const uint32_t data_or_end_addr_u32,
                                     const uint8_t  fcb_cmd_u08 )
{
    volatile uint8_t    reg_FSSQ;

    R_FCL_WriteMemoryU08 (FCB_REG_ADDR_FLARS_U08, FCB_REG_FLARS_USER_AREA);

    if (FCB_REG_BIT_FSSQ_CMD_READ == fcb_cmd_u08)
    {
        if (0 == FLASH.DFLCTL.BIT.DFLEN)                                                           /* PRQA S 0303 */
        {
            g_fclInternal_str.fclDataFlashMemAccess_u08 = FCL_DATA_FLASH_ACCESS_BY_LIBRARY;
            FLASH.DFLCTL.BIT.DFLEN = 1;                                                            /* PRQA S 0303 */
            if (REG_OPCCR_MASK_MODE_HIGH_SPEED == (uint8_t)SYSTEM.OPCCR.BIT.OPCM)                  /* PRQA S 0303 */
            {
                /* High speed operating mode */
                R_FCL_WaitUs (WAIT_TSTOP_TIME_HS_Us, g_fclInternal_str.fclCpuFreqMHz_u08);
            }
            else
            {
                /* Middle speed operating mode */
                R_FCL_WaitUs (WAIT_TSTOP_TIME_MS_Us, g_fclInternal_str.fclCpuFreqMHz_u08);
            }
        }
    }

    R_FCL_WriteMemoryU16 (FCB_REG_ADDR_FLAPL_U16, (uint16_t)(flash_addr_u32 & 0xFFFFu));
    R_FCL_WriteMemoryU08   (FCB_REG_ADDR_FLAPH_U08, (uint8_t)(flash_addr_u32 >> 16u) & 0x0Fu);

    if (FCB_REG_BIT_FSSQ_CMD_WRITE == fcb_cmd_u08)
    {
        R_FCL_WriteMemoryU16 (FCB_REG_ADDR_FLSEDL_U16, 0x0000u);
        R_FCL_WriteMemoryU08   (FCB_REG_ADDR_FLSEDH_U08, 0x00u);
        R_FCL_WriteMemoryU16 (FCB_REG_ADDR_FLWL_U16, (uint16_t)(data_or_end_addr_u32 & 0xFFFFu));
        R_FCL_WriteMemoryU16 (FCB_REG_ADDR_FLWH_U16, (uint16_t)(data_or_end_addr_u32 >> 16u));
    }
    else
    {
        R_FCL_WriteMemoryU16 (FCB_REG_ADDR_FLSEDL_U16, (uint16_t)(data_or_end_addr_u32 & 0xFFFFu));
        R_FCL_WriteMemoryU08 (FCB_REG_ADDR_FLSEDH_U08, (uint8_t)(data_or_end_addr_u32 >> 16u) & 0x0Fu);
        R_FCL_WriteMemoryU16 (FCB_REG_ADDR_FLWL_U16, 0x0000u);
        R_FCL_WriteMemoryU16 (FCB_REG_ADDR_FLWH_U16, 0x0000u);
    }

    /* Save command and start sequencer operation */
    R_FCL_WriteMemoryU08 (FCB_REG_ADDR_FSSQ_U08, fcb_cmd_u08);
    reg_FSSQ =  R_FCL_ReadMemoryU08 (FCB_REG_ADDR_FSSQ_U08);
    reg_FSSQ |= FCB_REG_BIT_FSSQ_SQST;
    R_FCL_WriteMemoryU08 (FCB_REG_ADDR_FSSQ_U08, reg_FSSQ);
}
/**********************************************************************************************************************
 End of function R_FCL_FCB_StartFlashOperation  
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function name: R_FCL_FCB_StartExtraAreaOperation 
 *********************************************************************************************************************/
/**
 * This function configures the Flash programming sequencer and starts the extra area operation 
 *
 * @param         start_addr_u32:       Start address for AW 
 * @param         end_addr_u32:         End address for AW
 * @param         fcb_cmd_u08:          Type of command: Set AW range or change start-up program swap flag
 *
 * @return        ---
 */
/*********************************************************************************************************************/
#if FCL_LIB_COMPILER == FCL_LIB_COMP_GNU
    /* Pragma is not available, but the functionality can be achieved using __attribute__ in function declaration */
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_IAR
    #pragma location="R_FCL_CODE_RAM"
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_REC
    #pragma section P R_FCL_CODE_RAM
#endif
void R_FCL_FCB_StartExtraAreaOperation ( const uint32_t start_addr_u32,
                                         const uint32_t end_addr_u32, 
                                         const uint8_t  fcb_cmd_u08 ) 
{
    uint16_t             start_addr;
    uint16_t             end_addr;
    volatile uint8_t     reg_FSSE;
    volatile uint16_t    reg_FLSEC;

    R_FCL_WriteMemoryU08 (FCB_REG_ADDR_FLARS_U08, FCB_REG_BIT_FLARS_EXA);

    if (0 == FLASH.DFLCTL.BIT.DFLEN)                                                               /* PRQA S 0303 */
    {
        g_fclInternal_str.fclDataFlashMemAccess_u08 = FCL_DATA_FLASH_ACCESS_BY_LIBRARY;
        FLASH.DFLCTL.BIT.DFLEN = 1;                                                                /* PRQA S 0303 */
        if (REG_OPCCR_MASK_MODE_HIGH_SPEED == (uint8_t)SYSTEM.OPCCR.BIT.OPCM)                      /* PRQA S 0303 */
        {
            /* High speed operating mode */
            R_FCL_WaitUs (WAIT_TSTOP_TIME_HS_Us, g_fclInternal_str.fclCpuFreqMHz_u08);
        }
        else
        {
            /* Middle speed operating mode */
            R_FCL_WaitUs (WAIT_TSTOP_TIME_MS_Us, g_fclInternal_str.fclCpuFreqMHz_u08);
        }
    }

