AndEmi81/indesit_inertia_rx210/HAL/RN_RX100/FCL/lib/r_fcl_hw_access.c
    R_FCL_WriteMemoryU16 (FCB_REG_ADDR_FLAPL_U16, 0x0000u);
    R_FCL_WriteMemoryU08   (FCB_REG_ADDR_FLAPH_U08, 0x00u);
    R_FCL_WriteMemoryU16 (FCB_REG_ADDR_FLSEDL_U16, 0x0000u);
    R_FCL_WriteMemoryU08   (FCB_REG_ADDR_FLSEDH_U08, 0x00u);

    if (fcb_cmd_u08 == FCB_REG_BIT_FSSE_CMD_WRT_AW)
    {
        /* Calculate start and end block addresses */
        /* Only bits 19-10 are needed */
        start_addr = (uint16_t)(start_addr_u32 >> 10);
        end_addr   = ((uint16_t)(end_addr_u32 >> 10)) + 1;
    }
    else
    {
        reg_FLSEC  = R_FCL_ReadMemoryU16 (FCB_REG_ADDR_FLSEC_U16);
        start_addr = reg_FLSEC ^ FCB_REG_BIT_FLSEC_BTFLG; /* Invert start-up program swap flag */
        end_addr   = 0xFFFF; 
    }

    /* Set start address or data information */
    R_FCL_WriteMemoryU16 (FCB_REG_ADDR_FLWL_U16, start_addr);
    R_FCL_WriteMemoryU16 (FCB_REG_ADDR_FLWH_U16, end_addr);

    /* Save command and start sequencer operation */
    R_FCL_WriteMemoryU08 (FCB_REG_ADDR_FSSE_U08, fcb_cmd_u08);
    reg_FSSE =  R_FCL_ReadMemoryU08 (FCB_REG_ADDR_FSSE_U08);
    reg_FSSE |= FCB_REG_BIT_FSSE_ESQST;
    R_FCL_WriteMemoryU08 (FCB_REG_ADDR_FSSE_U08, reg_FSSE);
}
/**********************************************************************************************************************
 End of function R_FCL_FCB_StartExtraAreaOperation  
 *********************************************************************************************************************/
 
/**********************************************************************************************************************
 * Function name: R_FCL_TempSwapChange 
 *********************************************************************************************************************/
/**
 * Function swaps the start-up program area 0 and start-up program area 1 physically without setting 
 * the start-up program swap flag. After reset, the start-up program area will be activated regarding the 
 * start-up program swap flag.
 * Called by R_FCL_ChangeSwapState.
 *
 * @param         ---
 *
 * @return        ---
 */
/*********************************************************************************************************************/
#if FCL_LIB_COMPILER == FCL_LIB_COMP_GNU
    /* Pragma is not available, but the functionality can be achieved using __attribute__ in function declaration */
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_IAR
    #pragma location="R_FCL_CODE_ROMRAM"
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_REC
    #pragma section P R_FCL_CODE_ROMRAM
#endif
void R_FCL_TempSwapChange ( void )
{
    volatile uint8_t    reg_FSSET;

    /* In order to modify the temporary start-up program swap state, the bits EEEMD or FLSPM have to be set */
    R_FCL_CheckSetBitEEEMD();

    reg_FSSET = R_FCL_ReadMemoryU08 (FCB_REG_ADDR_FSSET_U08);
    reg_FSSET ^= FCB_REG_BIT_FSSET_TMBTSEL;
    reg_FSSET |= FCB_REG_BIT_FSSET_TMSPMD;
    R_FCL_WriteMemoryU08 (FCB_REG_ADDR_FSSET_U08, reg_FSSET);

    /* reset the EEEMD bit after operation finished */
    R_FCL_CheckResetBitEEEMD();
}
/**********************************************************************************************************************
 End of function R_FCL_TempSwapChange  
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function name: R_FCL_GetStartupProgramSwapFlag 
 *********************************************************************************************************************/
/**
 * Checks if a start-up program swap will be performed after reset.
 *
 * @param         ---
 *
 * @return        R_FCL_NO_SPS_FLAG_SWAP: no start-up program swap
 *                R_FCL_SPS_FLAG_SWAPPED: start-up program swap will be performed after reset
 */
/*********************************************************************************************************************/
#if FCL_LIB_COMPILER == FCL_LIB_COMP_GNU
    /* Pragma is not available, but the functionality can be achieved using __attribute__ in function declaration */
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_IAR
    #pragma location="R_FCL_CODE_ROMRAM"
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_REC
    #pragma section P R_FCL_CODE_ROMRAM
#endif
r_fcl_sps_flag_status_t R_FCL_GetStartupProgramSwapFlag ( void )
{
    volatile uint16_t         reg_FLSEC;
    r_fcl_sps_flag_status_t   flag ;

    flag      = R_FCL_NO_SPS_FLAG_SWAP;
    reg_FLSEC = R_FCL_ReadMemoryU16 (FCB_REG_ADDR_FLSEC_U16);

    if (FCB_REG_BIT_FLSEC_BTFLG != (reg_FLSEC & FCB_REG_BIT_FLSEC_BTFLG))
    {
        flag = R_FCL_SPS_FLAG_SWAPPED;
    }

    return flag;
}
/**********************************************************************************************************************
 End of function R_FCL_GetStartupProgramSwapFlag  
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function name: R_FCL_GetOperatingMode 
 *********************************************************************************************************************/
/**
 * Determines what is the current operating mode.
 * Called by R_FCL_SetFrequency.
 *
 * @param         ---
 *
 * @return        power operating mode:
 * @li            FCL_LOW_SPEED_OP_MODE
 * @li            FCL_MIDDLE_SPEED_OP_MODE
 * @li            FCL_HIGH_SPEED_OP_MODE
 */
/*********************************************************************************************************************/
#if FCL_LIB_COMPILER == FCL_LIB_COMP_GNU
    /* Pragma is not available, but the functionality can be achieved using __attribute__ in function declaration */
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_IAR
    #pragma location="R_FCL_CODE_ROMRAM"
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_REC
    #pragma section P R_FCL_CODE_ROMRAM
#endif
uint8_t R_FCL_GetOperatingMode ( void )
{
    uint8_t operating_mode;

    /* Check if in high-speed or middle-speed operating mode */
    if (0 == SYSTEM.SOPCCR.BIT.SOPCM)                                                              /* PRQA S 0303 */
    {
        if (REG_OPCCR_MASK_MODE_HIGH_SPEED == (uint8_t)SYSTEM.OPCCR.BIT.OPCM)                      /* PRQA S 0303 */
        {
            operating_mode = FCL_HIGH_SPEED_OP_MODE;
        }
        else
        {
            operating_mode = FCL_MIDDLE_SPEED_OP_MODE;
        }
    }
    else
    {
        operating_mode = FCL_LOW_SPEED_OP_MODE;
    }

    return operating_mode;
}
/**********************************************************************************************************************
 End of function R_FCL_GetOperatingMode  
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function name: R_FCL_GetCodeFlashSize 
 *********************************************************************************************************************/
/**
 * Outputs the code flash size. The information is read from the PORGA register, bits 2-0.
 * Called by R_FCL_GetBlockCnt.
 *
 * @param         ---
 *
 * @return        code flash size: 
 * @li            0: 2MByte
 * @li            1: 1MByte
 * @li            2: 512KByte
 * @li            3: 256KByte
 * @li            4: 128KByte
 * @li            5: 64KByte
 * @li            6: 32KByte
 * @li            7: 16KByte
 */
/*********************************************************************************************************************/
#if FCL_LIB_COMPILER == FCL_LIB_COMP_GNU
    /* Pragma is not available, but the functionality can be achieved using __attribute__ in function declaration */
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_IAR
    #pragma location="R_FCL_CODE_ROMRAM"
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_REC
    #pragma section P R_FCL_CODE_ROMRAM
#endif
uint16_t R_FCL_GetCodeFlashSize ( void )
{
    volatile uint16_t    size;

