AndEmi81/indesit_inertia_rx210/HAL/RN_RX100/FCL/lib/r_fcl_hw_access.c
    size = R_FCL_ReadMemoryU16 (FCB_REG_ADDR_PORGA_U16);
    size &= FCB_REG_PORGA_ROM_SIZE_MASK;

    #ifdef FCL_TEST_PATCH
        if (test_patch.act_flag_dev_flash_size != false)
        {
            size = test_patch.flash_size;
            test_patch.act_flag_dev_flash_size = false;
        }
    #endif

    return size;
}
/**********************************************************************************************************************
 End of function R_FCL_GetCodeFlashSize  
 *********************************************************************************************************************/
 
/**********************************************************************************************************************
 * Function name: R_FCL_StartupProgramSwapState 
 *********************************************************************************************************************/
/**
 * Function returns the current start-up program swap state, no matter if a temporary or a permanent swap 
 * was performed or not.
 * Called by R_FCL_GetSwapState.
 *
 * @param         ---
 *
 * @return        current start-up program swap state:
 * @li            R_FCL_NO_SP_SWAP: Start-up program swap was not performed
 * @li            R_FCL_SP_SWAPPED: Either a temporary or a permanent start-up program swap was performed
 */
/*********************************************************************************************************************/
#if FCL_LIB_COMPILER == FCL_LIB_COMP_GNU
    /* Pragma is not available, but the functionality can be achieved using __attribute__ in function declaration */
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_IAR
    #pragma location="R_FCL_CODE_ROMRAM"
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_REC
    #pragma section P R_FCL_CODE_ROMRAM
#endif
r_fcl_sps_status_t R_FCL_StartupProgramSwapState ( void )
{
    r_fcl_sps_status_t   sps_status;
    volatile uint8_t     reg_FSSET;

    reg_FSSET = R_FCL_ReadMemoryU08 (FCB_REG_ADDR_FSSET_U08);
    /* Bit TMSPMD already set by R_FCL_Init function, no need to check it again */
    if (FCB_REG_BIT_FSSET_TMBTSEL == (reg_FSSET & FCB_REG_BIT_FSSET_TMBTSEL))
    {
        sps_status = R_FCL_SP_SWAPPED;
    }
    else
    {
        sps_status = R_FCL_NO_SP_SWAP;
    }

    return sps_status;
}
/**********************************************************************************************************************
 End of function R_FCL_StartupProgramSwapState  
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function name: R_FCL_GetSPASize 
 *********************************************************************************************************************/
/**
 * Function gets the current size of start-up program area.
 * Called by R_FCL_GetStartupAreaSize.
 *
 * @param         ---
 *
 * @return        Start-up program area size:
 * @li            0x00: Start-up program area size is 4KB
 * @li            0x01: Start-up program area size is 8KB
 * @li            0x02: Start-up program area size is 16KB
 * @li            0x03: Start-up program area size is the same as for 0x00, in our case 4KB
 */
/*********************************************************************************************************************/
#if FCL_LIB_COMPILER == FCL_LIB_COMP_GNU
    /* Pragma is not available, but the functionality can be achieved using __attribute__ in function declaration */
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_IAR
    #pragma location="R_FCL_CODE_ROMRAM"
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_REC
    #pragma section P R_FCL_CODE_ROMRAM
#endif
uint8_t R_FCL_GetSPASize ( void )
{
    uint8_t           spa_size;
    volatile uint16_t reg_PORGA;

    reg_PORGA =   R_FCL_ReadMemoryU16 (FCB_REG_ADDR_PORGA_U16);
    reg_PORGA &=  FCB_REG_MASK_PORGA_SPA_SIZE;
    reg_PORGA >>= FCL_SPA_SIZE_SHIFT_BIT;

    spa_size = (uint8_t)reg_PORGA;

    return spa_size;
}
/**********************************************************************************************************************
 End of function R_FCL_GetSPASize  
 *********************************************************************************************************************/
 
/**********************************************************************************************************************
 * Function name: R_FCL_GetAWStartAddr 
 *********************************************************************************************************************/
/**
 * Calculates the starting address of the AW range.
 * Called by R_FCL_GetAW.
 *
 * @param         ---
 *
 * @return        starting address of AW
 */
/*********************************************************************************************************************/
#if FCL_LIB_COMPILER == FCL_LIB_COMP_GNU
    /* Pragma is not available, but the functionality can be achieved using __attribute__ in function declaration */
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_IAR
    #pragma location="R_FCL_CODE_ROMRAM"
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_REC
    #pragma section P R_FCL_CODE_ROMRAM
#endif
uint32_t R_FCL_GetAWStartAddr ( void )
{
    volatile uint32_t    reg_FLFSWE;
    uint32_t             start_addr;

    reg_FLFSWE = (uint32_t)R_FCL_ReadMemoryU16 (FCB_REG_ADDR_FLFSWE_U16);
    /* only bits 19-10 are saved */
    start_addr = (reg_FLFSWE << 10);

    return start_addr;
}
/**********************************************************************************************************************
 End of function R_FCL_GetAWStartAddr  
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function name: R_FCL_GetAWEndAddr 
 *********************************************************************************************************************/
/**
 * Calculates the ending address of the AW range.
 * Called by R_FCL_GetAW.
 *
 * @param         ---
 *
 * @return        ending address of AW
 */
/*********************************************************************************************************************/
#if FCL_LIB_COMPILER == FCL_LIB_COMP_GNU
    /* Pragma is not available, but the functionality can be achieved using __attribute__ in function declaration */
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_IAR
    #pragma location="R_FCL_CODE_ROMRAM"
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_REC
    #pragma section P R_FCL_CODE_ROMRAM
#endif
uint32_t R_FCL_GetAWEndAddr ( void )
{
    volatile uint32_t    reg_FLFSWS;
    uint32_t             end_addr;

    reg_FLFSWS = (uint32_t)R_FCL_ReadMemoryU16 (FCB_REG_ADDR_FLFSWS_U16);
    /* only bits 19-10 are saved */
    end_addr = (reg_FLFSWS << 10);

