AndEmi81/indesit_inertia_rx210/HAL/RN_RX100/FCL/lib/r_fcl_hw_access.c
    return end_addr;
}
/**********************************************************************************************************************
 End of function R_FCL_GetAWEndAddr  
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function name: R_FCL_SetFlashFrequency 
 *********************************************************************************************************************/
/**
 * Calculates the Flash IF frequency to be used by FCB.
 * Called by R_FCL_SetFrequency.
 *
 * @param         cpu_freq_u08:  CPU frequency
 * @param[out]    fcb_freq_pu08: Calculated Flash IF frequency
 *
 * @return        Operation status:
 */
/*********************************************************************************************************************/
#if FCL_LIB_COMPILER == FCL_LIB_COMP_GNU
    /* Pragma is not available, but the functionality can be achieved using __attribute__ in function declaration */
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_IAR
    #pragma location="R_FCL_CODE_ROMRAM"
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_REC
    #pragma section P R_FCL_CODE_ROMRAM
#endif
void R_FCL_SetFlashFrequency ( const uint8_t cpu_freq_u08, uint8_t * const fcb_freq_pu08 )
{
    *fcb_freq_pu08 = (uint8_t)((uint32_t)(cpu_freq_u08) << SYSTEM.SCKCR.BIT.ICK);              /* PRQA S 0303 */
    *fcb_freq_pu08 >>= SYSTEM.SCKCR.BIT.FCK;                                                   /* PRQA S 0303 */
}
/**********************************************************************************************************************
 End of function R_FCL_SetFlashFrequency  
 *********************************************************************************************************************/


/**********************************************************************************************************************
 * Function name: R_FCL_OngoingDataFlashOp 
 *********************************************************************************************************************/
/** 
 *  Function checks if a data flash access is ongoing 
 *
 *  @param          --- 
 *  @return         true:  ongoing data flash access
 *                  false: no data flash access 
 */ 
/*********************************************************************************************************************/
#if FCL_LIB_COMPILER == FCL_LIB_COMP_GNU
    /* Pragma is not available, but the functionality can be achieved using __attribute__ in function declaration */
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_IAR
    #pragma location="R_FCL_CODE_ROMRAM"
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_REC
    #pragma section P R_FCL_CODE_ROMRAM
#endif
rBool R_FCL_OngoingDataFlashOp ( void )
{
    rBool               df_ongoing;
    volatile uint8_t    reg_FLPMC;
    
    df_ongoing = false;

    /* check if a Data Flash operation is on-going */
    reg_FLPMC = R_FCL_ReadMemoryU08 (FCB_REG_ADDR_FLPMC_U08);

    if ( FCB_REG_BIT_FLPMC_EEEMD == (reg_FLPMC & FCB_REG_BIT_FLPMC_EEEMD) )
    {
        df_ongoing = true;
    }
    
    return df_ongoing;
}
/**********************************************************************************************************************
 End of function R_FCL_OngoingDataFlashOp  
 *********************************************************************************************************************/
 
/**********************************************************************************************************************
 * Function name: R_FCL_InitSwapStateFlag 
 *********************************************************************************************************************/
/** 
 *  Initializes the swap state flag by copying the value from extra area(BTFLG bit) to the  Flash sequencer and 
 *  initialization register (FSSET)
 *  Called by R_FCL_Init.
 *
 *  @param          --- 
 *  @return         --- 
 */ 
/*********************************************************************************************************************/
#if FCL_LIB_COMPILER == FCL_LIB_COMP_GNU
    /* Pragma is not available, but the functionality can be achieved using __attribute__ in function declaration */
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_IAR
    #pragma location="R_FCL_CODE_ROM"
#elif FCL_LIB_COMPILER == FCL_LIB_COMP_REC
    #pragma section P R_FCL_CODE_ROM
#endif
void R_FCL_InitSwapStateFlag( void )
{
    uint8_t              new_val;
    volatile uint16_t    reg_FLSEC;
    volatile uint8_t     reg_FSSET;

    reg_FLSEC = R_FCL_ReadMemoryU16 (FCB_REG_ADDR_FLSEC_U16);
    /* Extract BTFLG bit and invert value */
    reg_FLSEC &= FCB_REG_BIT_FLSEC_BTFLG;
    reg_FLSEC ^= FCB_REG_BIT_FLSEC_BTFLG;

    /*MS reg_FSSET = R_FCL_ReadMemoryU08 (FCB_REG_ADDR_FSSET_U08); */
    reg_FSSET =  *( (volatile uint8_t *)(FCB_REG_ADDR_FSSET_U08) );

    /* Update the FCB_REG_BIT_FSSET_TMSPMD only once */
    if (FCB_REG_BIT_FSSET_TMSPMD != (reg_FSSET & FCB_REG_BIT_FSSET_TMSPMD))
    {
        /* In order to modify the temporary start-up program swap state, 
           the bits EEEMD or FLSPM have to be set */
        R_FCL_CheckSetBitEEEMD();

        /* Calculate new value for temporary start-up program swap state*/
        new_val = ((uint8_t)(reg_FLSEC >> 2)) & FCB_REG_BIT_FSSET_TMBTSEL;

        /* Reset temporary start-up program swap state */
        reg_FSSET &= (~FCB_REG_BIT_FSSET_TMBTSEL);
        reg_FSSET |= new_val;
        
        R_FCL_WriteMemoryU08 (FCB_REG_ADDR_FSSET_U08, reg_FSSET);
        reg_FSSET = R_FCL_ReadMemoryU08 (FCB_REG_ADDR_FSSET_U08);
        reg_FSSET |= FCB_REG_BIT_FSSET_TMSPMD;
        R_FCL_WriteMemoryU08 (FCB_REG_ADDR_FSSET_U08, reg_FSSET);

        /* reset the EEEMD bit after operation finished */
        R_FCL_CheckResetBitEEEMD();
    }
}
/**********************************************************************************************************************
 End of function R_FCL_InitSwapStateFlag  
 *********************************************************************************************************************/
